msg_IntroMyself = """你好，我是蔡旭懷，我目前就讀臺灣大學資訊工程學系三年級。         

我喜歡嘗試不同的新事物，也喜歡一股腦栽進自己熱愛的領域。遇到困難時，我會努力地思考解決方法，並且透過不斷地練習讓自己克服困難。 
「把困難的事情做一萬次，再困難的事情也會變得簡單」，這就是我的座右銘。  
              
我在大學階段主要寫過C/C++/Python/Shell Script，並且可以流暢地使用這些語言進行開發。
除此之外，我也熟悉常用的資料結構&演算法，並對作業系統/網路有著不錯的了解。"""

msg_NASA_Experience = """我在大學期間參加了我們資工系系上的NASA團隊，這個團隊的全名 \
是“NetWork Administration & System Administration”，主要負責管理系上的網路/系統。

我現在是NASA團隊中DNS組的組長，主要負責維護系上的DNS Server，也有動手撰寫一些小的shell script\
來監測DNS伺服器對外的網路狀況以及檢查DNS伺服器的運作情形。

這是我們NASA各項服務的監控網站，是我們和其他組一起合力完成的一個期末專案。
https://monitor2.csie.ntu.edu.tw/login
(需要帳號密碼才能登入查看)
"""

msg_PA_Experience = """我在大學期間參加了一個比較冷門的社團組織，叫做台大PA組。

PA是Public Address的縮寫，主要的工作包括架設音響系統、現場使用控台混音等等，\
也就是大家每次看演唱會或是表演時，坐在控台桌的PA大哥以及在舞台上忙上忙下的工作人員\
所做的事情。

而我現在在PA組擔任的是教學的職位，負責安排下一屆的學弟妹的社課/訓練。

也正好因為台大很多科系很常有辦活動的需求，譬如之夜、系卡、系烤等等，\
因此我們台大PA組就有很多機會來幫台大的同學們處理PA方面的事情，讓\
讓整個活動可以進行地更加順利。一方面我們提供比較低的價錢讓台大學生處理好PA相關的業務，\
而另一方面也可以讓我們PA組的成員有更多可以大展身手的地方。

我覺得我在PA組學到非常多東西，包括整個音響系統是如何搭建的、各種音響控台的原理以及操作方式\
等等...。除此之外，在這整個過程中，我也暸解了PA這個工作的主要工作內容，雖然未來可能沒有將PA\
納入職業規劃的打算，但是我覺得這一趟在台大PA組的旅途帶給我的東西是很值得的！
"""
            